_posts/2016-06-14-fpgaIntroduction.html
---
layout: post
title: FPGAボードで学ぶ組込みシステム開発入門[SX-Card3編]
published: true
category: IT
tag: [FPGA, Spartan-3, SX-Card3]
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">FPGAボードで学ぶ組込みシステム開発入門[SX-Card3編]</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
小林 優(2013).  FPGAボードで学ぶ組込みシステム開発入門[Xilinx編] 技術評論社
</pre>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">1 FPGAボード</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">1-1 FPGA</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
参考書の表1-1(Spartan-3E)に対応する表
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> FPGA(Spartan-3A DSP XC3SD1800A)のFPGA規模</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Device</td>
<td class="left">XC3SD1800A</td>
</tr>

<tr>
<td class="left">Package Type</td>
<td class="left">676-ball Fine-Pitch Ball Grid Array(FBGA)</td>
</tr>

<tr>
<td class="left">Speed Grade</td>
<td class="left">4</td>
</tr>

<tr>
<td class="left">Temp Range</td>
<td class="left">Commercial(0℃ to 85℃)</td>
</tr>

<tr>
<td class="left">System Gates</td>
<td class="left">1800K</td>
</tr>

<tr>
<td class="left">Equivalent Logic Cells</td>
<td class="left">37,440</td>
</tr>

<tr>
<td class="left">Total CLBs</td>
<td class="left">4,160</td>
</tr>

<tr>
<td class="left">Total Slices</td>
<td class="left">16,640</td>
</tr>

<tr>
<td class="left">Block RAM Bits</td>
<td class="left">1512K</td>
</tr>

<tr>
<td class="left">DSP48As</td>
<td class="left">84</td>
</tr>

<tr>
<td class="left">DCMs</td>
<td class="left">8</td>
</tr>
</tbody>
</table>
<p>
CLB = Configurable Logic Block, 
DCM = Digital Clock Manager, 
LUT = Look Up Table  
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">1-2 使用するFPGAボード</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
参考書の表1-2に対応する表
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> 使用するFPGAボード(SX-Card3)</caption>

<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">メーカ</td>
<td class="right">Prime Systems, Inc.</td>
</tr>

<tr>
<td class="left">ボード名</td>
<td class="right">SX-Card3/DSP4</td>
</tr>

<tr>
<td class="left">FPGA</td>
<td class="right">Spartan-3A DSP</td>
</tr>

<tr>
<td class="left">外部メモリ</td>
<td class="right">18Mbit同期SRAM（512K x 36b)</td>
</tr>

<tr>
<td class="left">単体LED</td>
<td class="right">8</td>
</tr>

<tr>
<td class="left">汎用4bitDIP SW</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">汎用タクトSW</td>
<td class="right">1</td>
</tr>

<tr>
<td class="left">高速ユーザIO</td>
<td class="right">200</td>
</tr>

<tr>
<td class="left">汎用ユーザIO</td>
<td class="right">34x2</td>
</tr>

<tr>
<td class="left">GPIO</td>
<td class="right">8bit</td>
</tr>
</tbody>
</table>
<p>
使用できるボードという理由ではじめたので、このボードでどこまで参考書を適用できるかは不明。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">2 回路設計体験</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">3 進んだ回路設計</h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">4 MicroBlaze MCS</h3>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">5 MCSプログラミング</h3>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">6 自作周辺回路</h3>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">7 周辺回路設計</h3>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">8 外部メモリとグラフィック表示回路</h3>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">9 CMOSカメラ</h3>
</div>
</div>
